In [1]:
import pandas as pd
import numpy as np

In [2]:
test_data = pd.read_csv('C:/Users/rishav/Desktop/Demand forecasting/test.csv')

In [3]:
weekly_demand_data = pd.read_csv('C:/Users/rishav/Desktop/Demand forecasting/train_data/train.csv')

In [4]:
weekly_demand_data.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
0,1379560,1,55,1885,136.83,152.29,0,0,177
1,1466964,1,55,1993,136.83,135.83,0,0,270
2,1346989,1,55,2539,134.86,135.86,0,0,189
3,1338232,1,55,2139,339.50,437.53,0,0,54
4,1448490,1,55,2631,243.50,242.50,0,0,40

In [5]:
weekly_demand_data.shape

(456548, 9)

In [6]:
weekly_demand_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 456548 entries, 0 to 456547
Data columns (total 9 columns):
id                       456548 non-null int64
week                     456548 non-null int64
center_id                456548 non-null int64
meal_id                  456548 non-null int64
checkout_price           456548 non-null float64
base_price               456548 non-null float64
emailer_for_promotion    456548 non-null int64
homepage_featured        456548 non-null int64
num_orders               456548 non-null int64
dtypes: float64(2), int64(7)
memory usage: 31.3 MB

In [7]:
# weekly_demand_data.emailer_for_promotion = weekly_demand_data.emailer_for_promotion.astype('category')
# weekly_demand_data.homepage_featured = weekly_demand_data.homepage_featured.astype('category')

In [8]:
weekly_demand_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 456548 entries, 0 to 456547
Data columns (total 9 columns):
id                       456548 non-null int64
week                     456548 non-null int64
center_id                456548 non-null int64
meal_id                  456548 non-null int64
checkout_price           456548 non-null float64
base_price               456548 non-null float64
emailer_for_promotion    456548 non-null int64
homepage_featured        456548 non-null int64
num_orders               456548 non-null int64
dtypes: float64(2), int64(7)
memory usage: 31.3 MB

In [9]:
fulfilment_center_info = pd.read_csv('C:/Users/rishav/Desktop/Demand forecasting/train_data/fulfilment_center_info.csv')

In [10]:
fulfilment_center_info.head()

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0
3         66        648           34      TYPE_A      4.1
4         94        632           34      TYPE_C      3.6

In [11]:
fulfilment_center_info.shape

(77, 5)

In [12]:
meal_info = pd.read_csv('C:/Users/rishav/Desktop/Demand forecasting/train_data/meal_info.csv')

In [13]:
meal_info.head()

   meal_id   category cuisine
0     1885  Beverages    Thai
1     1993  Beverages    Thai
2     2539  Beverages    Thai
3     1248  Beverages  Indian
4     2631  Beverages  Indian

In [14]:
meal_info.shape

(51, 3)

In [15]:
weekly_demand_with_fulfilment_center = pd.merge(left = weekly_demand_data, right = fulfilment_center_info, how = 'inner', 
                                                on = 'center_id')

In [16]:
weekly_demand_with_fulfilment_center.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders,city_code,region_code,center_type,op_area
0,1379560,1,55,1885,136.83,152.29,0,0,177,647,56,TYPE_C,2.0
1,1466964,1,55,1993,136.83,135.83,0,0,270,647,56,TYPE_C,2.0
2,1346989,1,55,2539,134.86,135.86,0,0,189,647,56,TYPE_C,2.0
3,1338232,1,55,2139,339.50,437.53,0,0,54,647,56,TYPE_C,2.0
4,1448490,1,55,2631,243.50,242.50,0,0,40,647,56,TYPE_C,2.0

In [17]:
weekly_demand_with_fulfilment_center.shape

(456548, 13)

In [18]:
full_data = pd.merge(weekly_demand_with_fulfilment_center, meal_info, on = 'meal_id')

In [19]:
full_data.shape

(456548, 15)

In [20]:
full_data.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders,city_code,region_code,center_type,op_area,category,cuisine
0,1379560,1,55,1885,136.83,152.29,0,0,177,647,56,TYPE_C,2.0,Beverages,Thai
1,1018704,2,55,1885,135.83,152.29,0,0,323,647,56,TYPE_C,2.0,Beverages,Thai
2,1196273,3,55,1885,132.92,133.92,0,0,96,647,56,TYPE_C,2.0,Beverages,Thai
3,1116527,4,55,1885,135.86,134.86,0,0,163,647,56,TYPE_C,2.0,Beverages,Thai
4,1343872,5,55,1885,146.50,147.50,0,0,215,647,56,TYPE_C,2.0,Beverages,Thai

In [21]:
full_data.week.unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145], dtype=int64)

In [22]:
len(full_data.center_id.unique())

77

In [23]:
full_data.center_type.unique()

array(['TYPE_C', 'TYPE_B', 'TYPE_A'], dtype=object)

In [24]:
full_data.category.unique()

array(['Beverages', 'Rice Bowl', 'Starters', 'Pasta', 'Sandwich',
       'Biryani', 'Extras', 'Pizza', 'Seafood', 'Other Snacks', 'Desert',
       'Salad', 'Fish', 'Soup'], dtype=object)

In [25]:
len(full_data.category.unique())

14

In [26]:
len(full_data.meal_id.unique())

51

In [27]:
len(full_data.meal_id[full_data.emailer_for_promotion == 1].unique())

40

In [28]:
full_data.cuisine.unique()

array(['Thai', 'Indian', 'Italian', 'Continental'], dtype=object)

In [29]:
full_data['center_meal_id'] = full_data['center_id'].astype(str) + "-" + full_data['meal_id'].astype(str)

In [30]:
full_data.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders,city_code,region_code,center_type,op_area,category,cuisine,center_meal_id
0,1379560,1,55,1885,136.83,152.29,0,0,177,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
1,1018704,2,55,1885,135.83,152.29,0,0,323,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
2,1196273,3,55,1885,132.92,133.92,0,0,96,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
3,1116527,4,55,1885,135.86,134.86,0,0,163,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
4,1343872,5,55,1885,146.50,147.50,0,0,215,647,56,TYPE_C,2.0,Beverages,Thai,55-1885

In [31]:
#Getting the list of unique uids
center_meal_id = list(full_data.center_meal_id.unique())

In [32]:
temp_data = full_data[full_data.center_meal_id == '55-1885']

In [33]:
temp_data.tail()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders,city_code,region_code,center_type,op_area,category,cuisine,center_meal_id
140,1236628,141,55,1885,150.35,150.35,0,0,107,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
141,1436751,142,55,1885,148.47,148.47,0,0,121,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
142,1161827,143,55,1885,150.35,150.35,0,0,176,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
143,1292806,144,55,1885,150.35,152.35,0,0,162,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
144,1336751,145,55,1885,156.23,156.23,0,0,121,647,56,TYPE_C,2.0,Beverages,Thai,55-1885

In [34]:
len(full_data.center_meal_id.unique())

3597

In [35]:
# campaign = []
# for i  in np.arange(0, len(full_data)):
#     if full_data['emailer_for_promotion'][i] ==0 and full_data['homepage_featured'][i] == 0:
#         campaign.append(0)
#     elif full_data['emailer_for_promotion'][i] ==1 and full_data['homepage_featured'][i] == 0:
#         campaign.append(1)
#     elif full_data['emailer_for_promotion'][i] ==0 and full_data['homepage_featured'][i] == 1:
#         campaign.append(2)
#     else:
#         campaign.append(3)

In [36]:
np.arange(0,2)

array([0, 1])

In [37]:
full_data.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders,city_code,region_code,center_type,op_area,category,cuisine,center_meal_id
0,1379560,1,55,1885,136.83,152.29,0,0,177,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
1,1018704,2,55,1885,135.83,152.29,0,0,323,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
2,1196273,3,55,1885,132.92,133.92,0,0,96,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
3,1116527,4,55,1885,135.86,134.86,0,0,163,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
4,1343872,5,55,1885,146.50,147.50,0,0,215,647,56,TYPE_C,2.0,Beverages,Thai,55-1885

In [38]:
test_data.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured
0,1028232,146,55,1885,158.11,159.11,0,0
1,1127204,146,55,1993,160.11,159.11,0,0
2,1212707,146,55,2539,157.14,159.14,0,0
3,1082698,146,55,2631,162.02,162.02,0,0
4,1400926,146,55,1248,163.93,163.93,0,0

In [39]:
full_data.set_index('id', inplace=True)

In [40]:
full_data.head()

,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders,city_code,region_code,center_type,op_area,category,cuisine,center_meal_id
id,,,,,,,,,,,,,,,
1379560,1,55,1885,136.83,152.29,0,0,177,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
1018704,2,55,1885,135.83,152.29,0,0,323,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
1196273,3,55,1885,132.92,133.92,0,0,96,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
1116527,4,55,1885,135.86,134.86,0,0,163,647,56,TYPE_C,2.0,Beverages,Thai,55-1885
1343872,5,55,1885,146.50,147.50,0,0,215,647,56,TYPE_C,2.0,Beverages,Thai,55-1885

In [41]:
test_data.set_index('id', inplace = True)

In [42]:
test_data.head()

,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured
id,,,,,,,
1028232,146,55,1885,158.11,159.11,0,0
1127204,146,55,1993,160.11,159.11,0,0
1212707,146,55,2539,157.14,159.14,0,0
1082698,146,55,2631,162.02,162.02,0,0
1400926,146,55,1248,163.93,163.93,0,0

In [43]:
test_data['center_meal_id'] = test_data['center_id'].astype(str) + "-" + test_data['meal_id'].astype(str)

In [44]:
test_data.head()

,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,center_meal_id
id,,,,,,,,
1028232,146,55,1885,158.11,159.11,0,0,55-1885
1127204,146,55,1993,160.11,159.11,0,0,55-1993
1212707,146,55,2539,157.14,159.14,0,0,55-2539
1082698,146,55,2631,162.02,162.02,0,0,55-2631
1400926,146,55,1248,163.93,163.93,0,0,55-1248

In [77]:
center_meal_id = [item for item in list(test_data.center_meal_id.unique())  if item in 
                  list(full_data.center_meal_id.unique()) ]

In [78]:
len(center_meal_id)

3545

In [79]:
center_meal_id_not_in_train = [item for item in list(test_data.center_meal_id.unique())  if item not in 
                  list(full_data.center_meal_id.unique()) ]

In [83]:
center_meal_id_not_in_train

['92-2104', '73-1571', '73-2956']

In [46]:
# from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsRegressor

In [47]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()

In [48]:
from sklearn.model_selection import  GridSearchCV

In [49]:
feature_name = ['checkout_price', 'base_price', 'emailer_for_promotion', 'homepage_featured']

In [50]:
dependent = ['num_orders']

In [210]:
KNN_pred = pd.DataFrame({'id':[], 'prediction':[]})

In [211]:
import warnings
warnings.filterwarnings("ignore")


for i in np.arange(0, len(center_meal_id)):
    temp = full_data[full_data['center_meal_id']== center_meal_id[i]]
    test_temp = test_data[test_data['center_meal_id']== center_meal_id[i]]
    X_train = temp[feature_name]
    y_train = temp[dependent]
    X_test = test_temp[feature_name]
    try:
        X_train_scaled = scaler.fit_transform(X_train)
        X_test_scaled = scaler.transform(X_test)
    except:
        X_train_scaled= X_train
        X_test_scaled = X_test
    knn = KNeighborsRegressor(algorithm = 'brute')
    try:
        parameters = {'n_neighbors' : [2,3,4,5,7,9,11,13,15,17,19,21,23,25,27,29,31]}
        clf = GridSearchCV(knn, parameters, cv=5)
        clf.fit(X_train_scaled, y_train)
    except:
        clf = KNeighborsRegressor(algorithm = 'brute', n_neighbors=1)
        clf.fit(X_train_scaled, y_train)    
    l =clf.predict(X_test_scaled)
    l = list(l)
    pred = pd.DataFrame({'id':list(X_test.index), 'prediction': l})
    KNN_pred = KNN_pred.append(pred)

In [212]:
KNN_pred.shape

(32560, 2)

In [213]:
pred_mod = []
for i in np.arange(0, len(KNN_pred.prediction)):
    pred_mod.append(list(list(KNN_pred.prediction)[i])[0])

In [214]:
KNN_pred['pred_mod'] = pred_mod

In [215]:
KNN_pred = KNN_pred.drop('prediction', axis =1 )

In [216]:
KNN_pred.head()

          id    pred_mod
0  1028232.0  113.857143
1  1262649.0  108.142857
2  1453211.0  123.571429
3  1262599.0  113.857143
4  1495848.0  125.428571

In [148]:
KNN_pred.to_csv('C:/Users/rishav/Desktop/Demand forecasting/KNN_pred_1.csv')

In [112]:
test_data.shape

(32573, 8)

In [178]:
center_meal_id_not_in_train

['92-2104', '73-1571', '73-2956']

In [150]:
meal_info.head()

   meal_id   category cuisine
0     1885  Beverages    Thai
1     1993  Beverages    Thai
2     2539  Beverages    Thai
3     1248  Beverages  Indian
4     2631  Beverages  Indian

In [179]:
#let's create a dataset for the center-meal combination which are in test set but not in train set.
not_in_train = test_data[test_data['center_meal_id'].isin(center_meal_id_not_in_train)]

In [180]:
not_in_train.shape

(13, 8)

In [182]:
not_in_train.head()

,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,center_meal_id
id,,,,,,,,
1179493,149,92,2104,631.53,629.53,0,0,92-2104
1032374,149,73,1571,629.53,630.53,0,0,73-1571
1294006,149,73,2956,629.53,631.53,0,0,73-2956
1491271,150,73,1571,629.53,631.53,0,0,73-1571
1333321,150,73,2956,639.23,639.23,0,0,73-2956

In [193]:
# let's see the unique meal ids from the data set not_in_train

list(set(list(not_in_train.meal_id)))

[2104, 1571, 2956]

In [195]:
#As we can see there are three unique meal_id for which no data center-meal combination is available in train.
#lets check in which category and cuisine this meal_id belongs.

meal_info.category[meal_info.meal_id.isin(list(set(list(not_in_train.meal_id))))].unique()

array(['Fish'], dtype=object)

In [196]:
#similarly in which cuisine
meal_info.cuisine[meal_info.meal_id.isin(list(set(list(not_in_train.meal_id))))].unique()

array(['Continental'], dtype=object)

In [197]:
# as we can see that for fish and continental it is happenning.
#so what i have done is to predict the mean of those items.
full_data[(full_data.category == 'Fish') & (full_data.cuisine == 'Continental')]['num_orders'].mean()

85.59526847943458

In [198]:
#lets append this prediction in the not in train data set.
not_in_train['pred_mod'] = full_data[(full_data.category == 'Fish') & (full_data.cuisine == 'Continental')]['num_orders'].mean()

C:\Users\rishav\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [199]:
not_in_train.head()

,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,center_meal_id,pred_mod
id,,,,,,,,,
1179493,149,92,2104,631.53,629.53,0,0,92-2104,85.595268
1032374,149,73,1571,629.53,630.53,0,0,73-1571,85.595268
1294006,149,73,2956,629.53,631.53,0,0,73-2956,85.595268
1491271,150,73,1571,629.53,631.53,0,0,73-1571,85.595268
1333321,150,73,2956,639.23,639.23,0,0,73-2956,85.595268

In [200]:
not_in_train_pred = pd.DataFrame({'id': not_in_train.index, 'pred_mod': not_in_train.pred_mod})

In [204]:
not_in_train_pred = not_in_train_pred.reset_index(drop=True)

In [205]:
not_in_train_pred.head()

        id   pred_mod
0  1179493  85.595268
1  1032374  85.595268
2  1294006  85.595268
3  1491271  85.595268
4  1333321  85.595268

In [206]:
not_in_train_pred.shape

(13, 2)

In [217]:
KNN_pred_1 = KNN_pred.append(not_in_train_pred)

In [218]:
KNN_pred_1.shape

(32573, 2)

In [209]:
KNN_pred_1.to_csv('C:/Users/rishav/Desktop/Demand forecasting/KNN_pred_2.csv')